{
    "newsItems": [
	{
            "id": "25",
            "title": "Closing Ceremony",
            "date": "Friday 09 August 2024",
		    "time": "16:36",
            "description": "ESSLLI's closing ceremony at 6:45pm in Jean Monnet",
		    "fullMessage": "Join us for the closing ceremony of this year's ESSLLI, today 6:45pm - 7:15pm in Aula Jean Monnet. Find out who wins the student session's Best Paper Award, discover the location of next year's ESSLLI (it starts with a B) and enjoy a last get together as we say goodbye to this year's installment of your favorite summer school."
	},
	{
            "id": "24",
            "title": "Evening Lecture",
            "date": "Thursday 08 August 2024",
		    "time": "16:43",
            "description": "Today's evening lecture by Janet Pierrehumbert at 7pm",
		    "fullMessage": "Join us at 7pm in Aula Jean Monnet for the evening lecture by Janet Pierrehumbert: On the distributional hypothesis - why it works and how it doesn’t."
	},
	{
            "id": "23",
            "title": "Schedule Change",
            "date": "Wednesday 07 August 2024",
		    "time": "14:56",
            "description": "'Revisiting Event Semantics' finishes on Thursday",
	    "fullMessage": "The schedule for the course 'Revisiting Event Semantics' by Friederike Moltmann is slightly adapted. The 4th lecture takes place this evening (Wednesday 7th) from 6:40pm - 8:00pm in AV 00.17. The 5th and final lecture takes place tomorrow (Thursday 8th) during the usual lecture slot (11:00am - 12:30pm, AV 00.17). For this course, there will be no lecture on Friday."
	},
	{
            "id": "22",
            "title": "Evening Lecture",
            "date": "Tuesday 06 August 2024",
		    "time": "16:31",
            "description": "Today's evening lecture by David Adger at 7pm",
		    "fullMessage": "Join us for the Dick Oehrle Memorial Lecture: David Adger will talk about Mereological Syntax and Grammatical Locality. The evening lecture will take place this evening (Tuesday 6th) at 7pm in Aula Jean Monnet. "
	},
	{
            "id": "21",
            "title": "Room Change",
            "date": "Sunday 04 August 2024",
		    "time": "11:46",
            "description": "Valentin Goranko in room AV 91.12",
		    "fullMessage": "the course 'Logics for strategic reasoning about rational agents in social context' by Valentin Goranko (05:00pm-06:30pm) will be held in room AV 91.12"
	},
	{
	    "id": "20",
	    "title": "Course Cancellation",
	    "date": "Sunday 04 August 2024",
	    "time": "11:44",
	    "description": "'Linear Logic' course cancelled",
	    "fullMessage": "The second week course Linear Logic by Davide Catta and Christian Retoré (Introductory) will need to be cancelled due to personal reasons."
	},
	{
	    "id": "19",
	    "title": "Beer and Belgian Fries",
	    "date": "Friday 02 August 2024",
	    "time": "15:20",
	    "description": "Join us outside at 6:30pm for beer and Belgian fries.",
	    "fullMessage": "A small chance of rain won't keep us from holding the student party outside. On top of that, we're starting half an hour earlier, directly after the last lectures at 6:30pm. Meet us at the funny little statue square for a 'pintje', and come taste why calling fries 'French' is a serious case of catachresis."
	},
	{
	    "id": "18",
	    "title": "Football Match",
	    "date": "Friday 02 August 2024",
	    "time": "11:25",
	    "description": "Come and take part in the ESSLLI football match",
	    "fullMessage": "The ESSLLI football match is a long-standing tradition that brings participants and lecturers together for some friendly competition. No experience or special skills required—just bring your enthusiasm and enjoy some casual competition on Monday 5th August at 7pm. We will leave from campus together after the lectures. To participate, just post a message in the #⁠football channel on Discord, so we can organize teams!"
	},
	{
	    "id": "17",
	    "title": "Beth Award and Student Poster Session",
	    "date": "Thursday 01 August 2024",
	    "time": "18:12",
	    "description": "Beth dissertation award and student poster session during student session slot.",
	    "fullMessage": "The E.W. Beth Dissertation Award Ceremony (prize to outstanding Ph.D. dissertations in Logic, Language, and Information) will take place on Friday 2nd August during the student session slot (3:50pm - 4:20pm). The ceremony will be followed by the student poster session (4:20pm - 5:00pm). Note that the poster presenters will already be present during the coffee break (3:30pm - 3:50pm) so you can already visit the poster session during the coffee break."
	},
	{
	    "id": "16",
	    "title": "Cancelled Session",
	    "date": "Thursday 01 August 2024",
	    "time": "16:37",
	    "description": "Final session of 'Propositions as Sessions' cancelled",
	    "fullMessage": "The final session of the course Propositions as Sessions: Logical Foundations of Concurrent Computation by Dan Frumin and Jorge A. Pérez (Friday 2 August, 09:00am - 10:30am) is cancelled due to illness of the lecturer."
	},
	{
	    "id": "15",
	    "title": "Face Masks",
	    "date": "Thursday 01 August 2024",
	    "time": "16:21",
	    "description": "Face masks available at the registration desk",
	    "fullMessage": "We are providing face masks for participants who need or want one. You can pick one up at the registration desk."
	},
{
            "id": "14",
            "title": "Weekend activity",
            "date": "Wednesday 31 July 2024",
		    "time": "12:53",
            "description": "A guided walk through the city of Leuven",
		    "fullMessage": "You've marvelled at Leuven's pretty city center, and you're curious about the stories and secrets that lie behind these historic facades? Kris Heylen, Leuven connaisseur par excellence, will take you on a guided walk of Leuven, this Saturday 3rd August, 2pm-4pm. Registration is free! Sign up using the form you'll find on Discord."
	},
{
            "id": "13",
            "title": "Room Change",
            "date": "Wednesday 31 July 2024",
		    "time": "00:03",
            "description": "Computational Models for Semantic Change in Aula Jean Monnet",
		    "fullMessage": "The course Computational Models for Semantic Change and their Applications in Multidisciplinary Research by Haim Dubossarsky and Pierluigi Cassotti (2:00pm - 3:30pm) will be held in Aula Jean Monnet for the remainder of the week."
	},
{
            "id": "12",
            "title": "Room Change",
            "date": "Wednesday 31 July 2024",
		    "time": "00:02",
            "description": "Categorial Foundations of Natural Language Structures in Aula Jean Monnet",
		    "fullMessage": "The course Categorial Foundations of Natural Language Structures by Mark Steedman (11:00am - 12:30pm) will be held in Aula Jean Monnet for the remainder of the week."
	},
{
            "id": "11",
            "title": "Room Change",
            "date": "Wednesday 31 July 2024",
		    "time": "00:01",
            "description": "Generative AI and Symbolic Knowledge Representations in Aula Jean Monnet",
		    "fullMessage": "The course Generative AI and Symbolic Knowledge Representations: Large Language Models, Knowledge, and Reasoning by Damir Cavar and Billy Dickson (9:00 - 10:30am) will be held in Aula Jean Monnet for the remainder of the week."
	},
{
            "id": "10",
            "title": "Room Change",
            "date": "Tuesday 30 July 2024",
		    "time": "15:22",
            "description": "Expressivity of Transformers in Aula Jean Monnet",
		    "fullMessage": "The course Expressivity of Transformers: Logic, Circuits, and Formal Languages by Jonathan Rawski and David Chiang (5:00pm - 6:30pm) will be held in Aula Jean Monnet for the remainder of the week."
	},
		{
            "id": "9",
            "title": "Room Change",
            "date": "Tuesday 30 July 2024",
		    "time": "15:20",
            "description": "Emma Vorlat lectures switched to Jean Monnet",
		    "fullMessage": "Room change: as Emma Vorlat has been heating up beyond comfortable, we're switching lecture halls. Starting at 5pm, lectures taking place in Emma Vorlat will be switched to Jean Monnet for the remainder of the week."
	},
		{
            "id": "8",
            "title": "Room Change",
            "date": "Monday 29 July 2024",
		    "time": "17:20",
            "description": "Valentin Goranko in room AV 00.17",
		    "fullMessage": "The course Games Logicians Play by Valentin Goranko (11:00am-12:30pm) will be held in room AV 00.17 for the remainder of the week."
	},
		{
            "id": "7",
            "title": "Welcome Reception Al Fresco",
            "date": "Monday 29 July 2024",
	    "time": "15:41",
            "description": "Welcome reception is moved outside.",
		    "fullMessage": "Have the welcome reception inside when the weather is this nice? That would be a shame! The welcome reception will be held outside, on the square with the funny statue. Start at 6:30pm, right after the final lecture slot."
	},
	{
            "id": "6",
            "title": "Water Fountains",
            "date": "Monday 29 July 2024",
	    "time": "13:14",
            "description": "Fill up your bottle at the water fountains.",
            "fullMessage": "It promises to be a hot week! Looking to (re)fill your bottle? There are two water fountains on site: one is located in the entrance hall of Jean Monnet, the other one is next to the on campus statue. On the discord #announcements channel, you'll find a map and some pictures."
	},
	{
            "id": "5",
            "title": "Breakfast & Registration",
            "date": "Monday 29 July 2024",
	    "time": "04:55",
            "description": "Come register and have breakfast at 8am.",
            "fullMessage": "Registration will start at 8am today. Remember to bring your personal registration code. Also remember that a complimentary breakfast buffet is served at Alma 2 from 8am till 9am!"
	},
	{
            "id": "4",
            "title": "Shared Photo Album",
            "date": "Sunday 28 July 2024",
	    "time": "23:05",
            "description": "Contribute to our shared Google Photos album.",
            "fullMessage": "We have created a shared photo album on Google Photos for the ESSLLI summer school in Leuven. You can find the link on the ESSLLI website and on Discord. Everyone with the link can view and add photos, so feel free to share the link with fellow participants."
	},
	{
            "id": "3",
            "title": "Course Cancellations",
            "date": "Sunday 28 July 2024",
	    "time": "22:18",
            "description": "Due to covid, two courses will need to be cancelled.",
            "fullMessage": "Unfortunately covid hit some of our lecturers. As a result, two courses will need to be cancelled: Dan Zeman -  The Semantics and Pragmatics of Slurs (Introductory) and Nazarre Merchant and Alan Prince - Analyzing OT Typologies: Order, Equivalence and the Mother of all Tableaux (Advanced). The schedule will be updated accordingly."
	},
	{
            "id": "2",
            "title": "Internet Access",
            "date": "Friday 26 July 2024",
	    "time": "21:46",
            "description": "More information on internet access on campus and at the student residences.",
            "fullMessage": "Up to date wifi credentials can be found on the 'About' Tab of this app. If you need to access a wired connection (or private router connected to the wired network), please get in touch with esslli2024@kuleuven.be"
	},
	{
            "id": "1",
            "title": "Welcome to ESSLLI 2024!",
            "date": "Friday 26 July 2024",
	    "time": "21:45",
            "description": "We're excited to have you in Leuven.",
            "fullMessage": "We're excited to have you in Leuven. The first students are starting to arrive at the residences, the badges have been printed, and the goodie bags are filled. We're looking forward to an inspiring time with all of you!"
	}
    ]
}
