{
    "newsItems": [
		{
            "id": "7",
            "title": "Welcome Reception Al Fresco",
            "date": "Monday 29 July 2024",
	    "time": "15:41",
            "description": "Welcome reception is moved outside.",
		    "fullMessage": "Have the welcome reception inside when the weather is this nice? That would be a shame! The welcome reception will be held outside, on the square with the funny statue. Start at 6:30pm, right after the final lecture slot."
	},
	{
            "id": "6",
            "title": "Water Fountains",
            "date": "Monday 29 July 2024",
	    "time": "13:14",
            "description": "Fill up your bottle at the water fountains.",
            "fullMessage": "It promises to be a hot week! Looking to (re)fill your bottle? There are two water fountains on site: one is located in the entrance hall of Jean Monnet, the other one is next to the on campus statue. On the discord #announcements channel, you'll find a map and some pictures."
	},
	{
            "id": "5",
            "title": "Breakfast & Registration",
            "date": "Monday 29 July 2024",
	    "time": "04:55",
            "description": "Come register and have breakfast at 8am.",
            "fullMessage": "Registration will start at 8am today. Remember to bring your personal registration code. Also remember that a complimentary breakfast buffet is served at Alma 2 from 8am till 9am!"
	},
	{
            "id": "4",
            "title": "Shared Photo Album",
            "date": "Sunday 28 July 2024",
	    "time": "23:05",
            "description": "Contribute to our shared Google Photos album.",
            "fullMessage": "We have created a shared photo album on Google Photos for the ESSLLI summer school in Leuven. You can find the link on the ESSLLI website and on Discord. Everyone with the link can view and add photos, so feel free to share the link with fellow participants."
	},
	{
            "id": "3",
            "title": "Course Cancellations",
            "date": "Sunday 28 July 2024",
	    "time": "22:18",
            "description": "Due to covid, two courses will need to be cancelled.",
            "fullMessage": "Unfortunately covid hit some of our lecturers. As a result, two courses will need to be cancelled: Dan Zeman -  The Semantics and Pragmatics of Slurs (Introductory) and Nazarre Merchant and Alan Prince - Analyzing OT Typologies: Order, Equivalence and the Mother of all Tableaux (Advanced). The schedule will be updated accordingly."
	},
	{
            "id": "2",
            "title": "Internet Access",
            "date": "Friday 26 July 2024",
	    "time": "21:46",
            "description": "More information on internet access on campus and at the student residences.",
            "fullMessage": "Up to date wifi credentials can be found on the 'About' Tab of this app. If you need to access a wired connection (or private router connected to the wired network), please get in touch with esslli2024@kuleuven.be"
	},
	{
            "id": "1",
            "title": "Welcome to ESSLLI 2024!",
            "date": "Friday 26 July 2024",
	    "time": "21:45",
            "description": "We're excited to have you in Leuven.",
            "fullMessage": "We're excited to have you in Leuven. The first students are starting to arrive at the residences, the badges have been printed, and the goodie bags are filled. We're looking forward to an inspiring time with all of you!"
	}
    ]
}
